app/views/gossips/index.html.erb

    <p class="card-text"> <%= gossip.title %> </p>
    <p class="card-text"><%  a = gossip.user_id %> Gossipeur : <%= @users.find(a).first_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]