app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<!-- La ligne suivante ne fonctionne pas pour afficher le bon user (l'auteur du potin)
<p> Auteur du potin : <%= User.find(@gossip.id).first_name%> </p>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
<!-- La ligne suivante est la bonne pour afficher le bon auteur -->
<p> Auteur du potin : <%= @gossip.user.first_name %> </p>