app/controllers/auteurs_controller.rb

  def show
    # Méthode qui récupère l'auteur concerné et l'envoie à la view show (show.html.erb) pour affichage
    # On récupère le user par l'intermédiaire de son id
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    # Méthode qui crée un auteur vide et l'envoie à une view qui affiche le formulaire pour 'le remplir' (new.html.erb)
    @users = User.all
---
SELECT "users".* FROM "users"