app/controllers/cities_controller.rb

  def show
  	#On récupère la ville correspondant à l'id de l'auteur du potin
  	@city = City.find(params[:id])
  	@gossips = Gossip.all
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"