app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    # Méthode qui récupère tous les potins et les envoie à la view index (index.html.erb) pour affichage
    @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # Méthode qui récupère l'id du potin à afficher et l'envoie à la view show (show.html.erb) pour affichage
    @gossip = Gossip.find(params[:id])

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fjmqds"], ["content", "fdlkqjsmdfkj"], ["user_id", 2], ["created_at", "2019-10-30 11:59:51.866651"], ["updated_at", "2019-10-30 11:59:51.866651"]]
---
 def create
   # Méthode qui créé un potin à partir du contenu du formulaire de new.html.erb, soumis par l'utilisateur
   # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
   # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)
   @gossip = Gossip.new(user_id: 2, title: params[:title], content: params[:content])

   if @gossip.save