app/views/cities/show.html.erb

			<!-- Affichage de l'auteur -->
			Auteur du potin : <%= gossip.user.first_name %><br/>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]